/*****************************************************************************
 * File:   serv_eeprom.c
 * Author: alexdg
 * Comments:
 * 
 * Revision history: 
 * Created on 30 de Setembro de 2023, 11:04 *  
 ****************************************************************************/

//===== Includes =============================================================

#include <xc.h>     //eeprom_read())

#include "serv_eeprom.h"
#include "base_eeprom.h"

//============================================================================
//===== Definições Públicas ==================================================
//============================================================================

//===== Constantes Públicas ==================================================

//===== Variaveis Públicas ===================================================

//============================================================================
//===== Definições Privadas ==================================================
//============================================================================

//===== Constantes Privadas ==================================================

//===== Tipos Privados =======================================================

//===== Variaveis Privadas ===================================================

//===== Declaração das Funções Privadas ======================================

//============================================================================
//===== Definição (implementação) das Funções Públicas =======================
//============================================================================

uint8_t serv_eeprom_verifica_inicializacao(void) {
  //Testa se a EEPROM já foi gravada pelo equipamento, retornando um boolean.
  //Se ainda não foi, então inicializa com os valores de configuração padrão.
  if (eeprom_read(EEPROM_END_CHAVE_INICIALIZACAO) == EEPROM_VALOR_CHAVE_INICIALIZACAO) {
    return 1;
  }
  else {
    return 0;
  }  
}//serv_eeprom_verifica_inicializacao()

//============================================================================
//===== Definição (implementação) das Funções Privadas =======================
//============================================================================

//===== Final do Arquivo =====================================================